- pandas:used for Data base reading writing modify the data
- numpy: used for numerical or math operations
- matplotlib: used for plotiing
- seaborn:used for plotiing

**Step:1-Import the packages**

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step:2-Create Dataframe using List**

In [7]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names)

        0
0  Ramesh
1  Suresh
2  Mahesh

**Step:3-Add columns**

In [8]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names,columns=['Names'])

    Names
0  Ramesh
1  Suresh
2  Mahesh

**Step:4-update the index**

In [10]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names,index=['A','B','C'])

        0
A  Ramesh
B  Suresh
C  Mahesh

In [11]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names,index=['A','B','C'],columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Mahesh

In [12]:
names=['Ramesh','Suresh','Mahesh']
idx=['A','B','C']
cols=['Names']
pd.DataFrame(names,index=idx,columns=cols)

    Names
A  Ramesh
B  Suresh
C  Mahesh

**Step:5-Create Dataframe with multiple columns**

In [25]:
names=['Ramesh','Suresh','Mahesh']
city=['Hyd','Pune','Mumbai']
data=(names,city)
idx=['A','B','C']
cols=['Names','city']
pd.DataFrame(data).T

        0       1
0  Ramesh     Hyd
1  Suresh    Pune
2  Mahesh  Mumbai

In [23]:
names=['Ramesh','Suresh','Mahesh']
city=['Hyd','Pune','Mumbai']
data=zip(names,city)
idx=['A','B','C']
cols=['Names','city']
pd.DataFrame(data)

        0       1
0  Ramesh     Hyd
1  Suresh    Pune
2  Mahesh  Mumbai

In [24]:
names=['Ramesh','Suresh','Mahesh']
city=['Hyd','Pune','Mumbai']
idx=['A','B','C']
cols=['Names','city']
pd.DataFrame(zip(names,city),index=idx,columns=cols)

    Names    city
A  Ramesh     Hyd
B  Suresh    Pune
C  Mahesh  Mumbai

In [26]:
names=['Ramesh','Suresh','Mahesh']
city=['Hyd','Pune','Mumbai']
age=[20,22,24]
idx=['A','B','C']
cols=['Names','city','Age']
pd.DataFrame(zip(names,city,age),index=idx,columns=cols)

    Names    city  Age
A  Ramesh     Hyd   20
B  Suresh    Pune   22
C  Mahesh  Mumbai   24

**Step:6-How to add data to empty dataframe**

In [27]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [31]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Mahesh']
df['Age']=[20,22,24]
df['City']=['Hyd','Pune','Mumbai']
df

    Names  Age    City
0  Ramesh   20     Hyd
1  Suresh   22    Pune
2  Mahesh   24  Mumbai

**Step:7-Create a dataframe using dictionary**

In [32]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Pune','Mumbai']}
d

{'Names': ['Ramesh', 'Suresh', 'Mahesh'],
 'Age': [20, 22, 24],
 'City': ['Hyd', 'Pune', 'Mumbai']}

In [34]:
df=pd.DataFrame(d)
df

    Names  Age    City
0  Ramesh   20     Hyd
1  Suresh   22    Pune
2  Mahesh   24  Mumbai

**Step:-8**

- shape
- size
- columns
- dtypes
- isnull

In [38]:
df.shape

(3, 3)

In [39]:
df.size

9

In [40]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [45]:
df.dtypes

Names    object
Age       int64
City     object
dtype: object

In [46]:
df.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False

In [47]:
df.isnull().sum()

Names    0
Age      0
City     0
dtype: int64

**Step:9-Rename the columns**

In [49]:
# if we want to rename all the columns
df.columns=['A','B','C']
df

        A   B       C
0  Ramesh  20     Hyd
1  Suresh  22    Pune
2  Mahesh  24  Mumbai

In [50]:
df.index=['A','B','C']
df

        A   B       C
A  Ramesh  20     Hyd
B  Suresh  22    Pune
C  Mahesh  24  Mumbai

In [51]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Pune','Mumbai']}
d

{'Names': ['Ramesh', 'Suresh', 'Mahesh'],
 'Age': [20, 22, 24],
 'City': ['Hyd', 'Pune', 'Mumbai']}

In [53]:
df=pd.DataFrame(d)
df

    Names  Age    City
0  Ramesh   20     Hyd
1  Suresh   22    Pune
2  Mahesh   24  Mumbai

In [61]:
d={'Names':'A','Age':20,'City':'Mumbai'}
df.rename(columns=d,inplace=True)
df

        A  20  Mumbai
0  Ramesh  20     Hyd
1  Suresh  22    Pune
2  Mahesh  24  Mumbai

In [66]:
d={0:'A',1:20,2:'Mumbai'}
df.rename(index=d,inplace=True)
df

             A  20  Mumbai
A       Ramesh  20     Hyd
20      Suresh  22    Pune
Mumbai  Mahesh  24  Mumbai

In [68]:
d={0:'A',1:20,2:'Mumbai'}
df.rename(d,inplace=True)
df

             A  20  Mumbai
A       Ramesh  20     Hyd
20      Suresh  22    Pune
Mumbai  Mahesh  24  Mumbai

**Practise**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
name=['Ramesh','Suresh','Mahesh']
age=[20,22,24]
city=['Hyd','Pune','Mumbai']
idx=['A','B','C']
cols=['Name','Age','City']
df=pd.DataFrame(zip(name,age,city),index=idx,columns=cols)
df

     Name  Age    City
A  Ramesh   20     Hyd
B  Suresh   22    Pune
C  Mahesh   24  Mumbai

In [3]:
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [5]:
df1['Names']=['Vishal','Adi','Roshan']
df1['Age']=[78,56,63]
df1['City']=['Nashik','Pune','Parbhani']
df1

    names  Age      City   Names
0  Vishal   78    Nashik  Vishal
1     Adi   56      Pune     Adi
2  Roshan   63  Parbhani  Roshan

In [8]:
d={'Names':['Ash','Ron','Tom'],
  'Age':[75,54,65],
  'City':['Dubai','Germany','France'],
  'Degree':['Law','B.Tech','M.A']}
df2=pd.DataFrame(d)
df2

  Names  Age     City  Degree
0   Ash   75    Dubai     Law
1   Ron   54  Germany  B.Tech
2   Tom   65   France     M.A

**Step:10-How to add a new data to existing Dataframe**

In [13]:
d1={'Names':['Ash','Ron','Tom'],
  'Age':[75,54,65],
  'City':['Dubai','Germany','France']}
df3=pd.DataFrame(d1)
df3['Marks']=[100,99,56]
df3['Age']=[100,200,300]
df3

  Names  Age     City  Marks
0   Ash  100    Dubai    100
1   Ron  200  Germany     99
2   Tom  300   France     56

**Step:11-Save the Dataframe**

- if we want to read or write we need three values
- where you want to save
- on which name you want to save
- on which format you want to save

- filename.txt

- filename.csv or filename.xlsx

- if i provide only file name it will save at cwd

In [18]:
df3.to_csv('data.csv',index=False)

**Step:12-Read the Dataframe**

In [20]:
pd.read_csv('data.csv')

  Names  Age     City  Marks
0   Ash  100    Dubai    100
1   Ron  200  Germany     99
2   Tom  300   France     56

In [26]:
df3.to_excel('data.xlsx',index=False)

In [27]:
pd.read_excel('data.xlsx')

  Names  Age     City  Marks
0   Ash  100    Dubai    100
1   Ron  200  Germany     99
2   Tom  300   France     56

In [28]:
import os

In [30]:
os.getcwd()

'C:\\Users\\HP\\Documents\\NareshIT\\EDA'

In [1]:
import pandas as pd

In [4]:
d={'Name':['s','V','R'],
  'Age':[30,32,34],
  'City':['nsk','Blr','Pune']}
df=pd.DataFrame(d)
df

  Name  Age  City
0    s   30   nsk
1    V   32   Blr
2    R   34  Pune